// Напишите программу. которая на вход принимает число и
// выдает его квадрат (число умноженное на само себя)
int value = 11;
int result = value * value;
Console.WriteLine (result);